/* eslint-disable linebreak-style */

export const teamInfoCols = [
  'SNo',
  '名前 1',

  '誕生日',
  '選手登録番号',
  'チーム番号',
  'メール',
  'ｊｒ. ユースクラブ',

  '利き足',
  '身長/cm',
  '電話番号',
  '保護者電話',

  'BMI',
  '血液型',
  'address',
  '郵便番号',

  'ジャージサイズ（上）',
  'ジャージサイズ（下）',
  '靴サイズ',
  '保護者名',
  '市町村',

  // ///////

  'ジャンプ CMJWA/m',
  'ジャンプ　スクワット　j/m',
  'ジャンプ　6J 手を使って/m',
  'ジャンプ　6J 手を使わない/m',
  '三段跳び　前進/m',
  'ジャンプ垂直　　左右/m',
  'Hｂ値',

  'ロングスロー　左右/m',
  'ロングキック　左右/m',
  'スクワット/1rm',
  'ベンチプレス/1rm',
  'クーパー　１２分/ラン/m',
  'WMA 45/15',
  'vo2max l/分',

  '1600m プロトコル/分',
  'シャトル　テンポ/分',
  'YO YO End. Int. Rec./分',
  '60m スプリント/秒',
  '50m スプリント/秒',
  '40m スプリント/秒',

  '30m スプリント/秒',
  '20m スプリント/秒',
  '10m スプリント/秒',
  'アジリティ測定　ステップ５０/秒',
  'アジリティ測定　前進ラン/秒',
  'ポジション',
  '体重/kg'
];

export const scoutingCols = [
  'SNo',
  '名前　１',
  '写真',
  '誕生日',
  '電話番号',
  '備考',
  'Jr.クラブ',
  'ユースクラブ',
  'ポジション',
  '利き足',
  '身長/cm',
  '体重/kg',
  '住所',
  '誕生日',
  'ビデオのハイパーリンク'
];

export const testingCols = [
  'SNo',
  '名前 1',

  'ジャンプ CMJWA/m',
  'ジャンプ　スクワット　J/m',
  'ジャンプ　6J 手を使って/m',
  'ジャンプ　6J 手を使わない/m',
  '三段跳び　前進/m',
  'ジャンプ垂直　　左右/m',
  'Hｂ値',

  'ロングスロー　左右/m',
  'ロングキック　左右/m',
  'スクワット/1rm',
  'ベンチプレス/1rm',
  'クーパー　１２分/ラン/m',
  'WMA 45/15 ',
  'VO2max l/分',

  '1600m プロトコル/分',
  'シャトル　テンポ/分',
  'YO YO End. Int. Rec./分',
  '60m スプリント/秒',
  '50m スプリント/秒',
  '40m スプリント/秒',
  '身長/cm',

  '30m スプリント/秒',
  '20m スプリント/秒',
  '10m スプリント/秒',
  'アジリティ測定　ステップ５０/秒',
  'アジリティ測定　前進ラン/秒',
  'ポジション',
  '体重/kg'
];

export const trainingMovCols = [
  'SNo',
  'トレーニング名',
  '実行時間/分',
  '説明',
  'キーファクター',
  '画像',
  'チェック済',
  'トレーニングビデオ',
  'ビデオのハイパーリンク',
  '日付',
  'トレーニングテーマ',
  'カテゴリー',
  'コーチ名',
  'トレーニング負荷'
];

export const gameAnalysisCols = [
  'SNo',
  '図1',
  '図2',
  '図3',
  '図4',
  '日付',
  '対戦チーム',
  'テーマ',
  'トーナメント/リーグ',
  '会場',
  '備考',
  'ゲームビデオ',
  'ビデオのハイパーリンク',
  'チェック済'
];

export const memberListViewCols = [
  'SNo',
  '選手登録番号',
  'cap',
  'pos',
  '名前　１',
  '名前　２',
  'ユニフォーム番号',
  '先発',
  'sub'
];

export const playerListViewCols = [
  'SNo',
  '名前1',
  '名前2',
  'ポジション',
  '年齢',
  '学年',
  '欠席',

  '出席',
  '欠席理由',
  'Jr.クラブ',
  'Jr.ユースクラブ',
  'カテゴリー',
  '移籍先'
];

export const monthlyViewCols = [
  '日',
  '曜日',
  '強度',
  'WUP',
  'フィジカル',
  '技術',
  'Tr1',
  'Tr2',
  '戦術',
  'Tr',
  'SSG',
  'ゲーム',
  'メインテーマ',
  '会場'
];

export const seasonalViewCols = [
  '月',
  '期分け',
  '',
  'トレーニング',
  'テキスト'
];
