/* eslint-disable global-require */
/* eslint-disable linebreak-style */

export const agilityScores = [
  'アジリティ測定　ステップ５０/秒',
  'アジリティ測定　前進ラン/秒'
];

export const bodySizePhysical = [
  '肩幅/cm',
  '胸囲/cm',
  '腕周り/cm',
  'ウエスト/cm',
  'ヒップ/cm',
  '大腿周り/cm',
  '脹脛/cm',
  '足首/cm'
];

export const dailyProgFields = [
  'メインテーマ',

  'Tr. 開始時間',
  'Tr. 終了時間',

  '人数',
  '欠席人数',

  'フィジカル',
  '技術',
  '戦術',

  '会場',
  'コーチ名',
  'Ph. コーチ名',

  'シーズン'
];

export const enduranceScores = [
  'クーパー　１２分/ラン',
  'WMA 45/15 ',
  '1600m プロトコル/分',
  'YO YO End. Int. Rec./分 ',
  'シャトル　テンポ/分（無酸素運動）'
];

export const gameAnalysisFields = [
  '対戦チーム',
  'ゲームビデオ',

  'チェック済',
  'テーマ',
  'ビデオのハイパーリンク',

  'トーナメント/リーグ',

  '会場'
];

export const gameInfoFields = [
  '会場',
  '天候',
  'コーチ名',
  '相手チーム',
  'シーズン',

  '前半',
  '後半',
  'フルタイム',

  '枠内シュート',
  'ゴールキック',
  'コーナーキック',
  '直接フリーキック',
  '間接フリーキック',
  'オフサイド',
  'gkセーブ'
];

export const gameReportFields = [
  '大会名',
  '名前　１',
  'ポジション',
  'スターティングメンバー',
  '出場時間',
  'イエローカード',
  'レッドカード',

  '枠内シュート',
  '枠内ミドルシュート',
  'ショートパス',
  'ミドルパス',
  'ロングパス',
  '右クロス',
  '左クロス',
  '右コーナーキック',
  '左コーナーキック',
  'ボールを奪う',
  '1対1攻撃の成功',
  '攻撃のヘディング',
  '守備のヘディング',
  'フリーキック',
  'ペナルティーキック',
  'ゴール（得点）',
  'ファインセーブ（キーパー）',
  'ゴールキック（キーパー）',

  '枠外シュート',
  '枠外ミドルシュート',
  'ショートパスネガティブ',
  'ミドルパスネガティブ',
  'ロングパスネガティブ',
  '1対1守備の失敗',
  'ボールを失う',
  'ゴールキック失敗（キーパー）',

  'ゴール（得点）',
  '成功したプレイ',
  '失敗したプレイ',
  '選手が関わったプレイ'
];

export const gameReportViewFields = ['会場', '天候', 'コーチ名', '相手チーム'];

export const generalEvalFields = ['イエローカード', 'レッドカード'];
export const generalEvalScores = ['戦術', '技術', 'メンタル', 'フィジカル'];

export const healthFields = [
  'カテゴリー',
  '誕生日',
  'チーム番号',
  '身長/cm',
  '体重/kg',
  'ポジション',
  '利き足',
  'メール',

  'ｂｍｉ',
  '血液型',
  'ｈｂ値',
  'VO2max/分',
  '血圧',

  '受傷日',
  '受傷の経緯',
  '受傷部位',
  '病名',
  '受傷の程度',
  '復帰までのスケジュール',

  'ＢＭＩ標準値',
  'Ｈｂ標準値',
  'VO2max l/分　標準値'
];
export const healthPhysical = [
  'パワー/ kg',
  'ストレングス/m',
  '持久力/分',
  'スピード/秒',
  'アジリティ/sec'
];

export const injuryFields = [
  '受傷部位',
  'アイシング',
  '縫合',
  '病院名',

  '病名',
  'テーピング',
  '投薬',
  '医師名',

  '受傷種類',
  '弾性包帯',
  'その他',
  '受傷の程度',

  '受傷の経緯',
  'ギブス',
  '救急車の使用',
  '復帰までのスケジュール',

  '受傷の状況',
  'リハビリスタッフ'
];

export const memberInfoFields = [
  '相手チーム',
  'トーナメント',
  '節',

  '前半',
  '後半',
  'フルタイム',

  '監督',
  'ヘッドコーチ',
  'アシスタントコーチ',
  'フィジカルコーチ',
  'キットマネージャー',

  '備考 １',
  '備考 2',
  '備考 3',
  '備考 4',
  '備考 5',

  '会場',

  'FP正',
  'FP副',
  'GK正',
  'GK副'
];

export const memberListFields = [
  'チーム名',

  '名前　１',
  '名前　２',
  'ユニフォーム番号',
  '選手登録番号',
  'ポジション',
  '会場',
  'cap',
  '先発',
  'sub'
];

export const memberViewFields = [
  '相手チーム',

  '前半',
  '後半',
  'フルタイム',

  'トーナメント',
  '節'
];

export const tacticalFields = [
  'カテゴリー',
  '誕生日',
  'チーム番号',
  '身長/cm',
  '体重/kg',
  'ポジション',
  '利き足',
  'メール',

  '肩幅/cm',
  '胸囲/cm',
  '腕周り/cm',
  'ウエスト/cm',
  'ヒップ/cm',
  '大腿周り/cm',
  '脹脛/cm',
  '足首/cm',

  'ｂｍｉ',
  '血液型',
  'ｈｂ値',
  'VO2max l/分',
  '血圧'
];
export const tacticalScores = [
  'スペースを作る',
  'サポート',
  '幅',
  '深み',
  'オバーラップ',
  '斜めランニング',
  'プレイ方向の選択（前）',
  'プレイのスピード',
  'ビルドアップ',
  'スウィッチポジション',
  'ポゼッション',
  '攻守の切り替え',
  'コンビネーションプレイ',
  'サイドチェンジ',
  'カウンター攻撃',
  '自陣からのサイドへ展開',
  'サイド攻撃',
  '中央攻撃',
  '攻撃ゾーンでの効果的プレイ',
  'セットプレイ',

  'マーキング',
  'アプローチ',
  'プレッシング',
  '遅らせる',
  'バックプレッシング',
  'カバーリング',
  'バランス',
  '挟み込み',
  'トラッキング',
  'グループ守備',
  'スウィッチゾーン',
  'ゾーンディフェンス',
  'プレッシングゾーン',
  'サイド攻撃の守備',
  'クロスの守備',
  'ディフェンスラインのコントロール',
  'リトリート',
  'コンパクト性',
  'カウンターの切り替え',
  'セットプレイ'
];

export const mentalScores = [
  'モチベーション',
  '忍耐力',
  '闘志',
  '自制心',
  '冷静さ',
  '集中力',
  '自信',
  '決断力',
  '予測力',
  '自己実現',
  '判断力',
  '協調性',
  'チャレンジ精神',
  '責任感',
  '人柄',
  '競争力',
  '実行力',
  'コミュニケーション能力',
  'リスペクト',
  '勝利へのこだわり'
];

export const technicalScores = [
  'ショートパス',
  'ロングパス',
  'ドリブル',
  'ターン',
  'シュート',
  'ボールコントロール',
  'ファーストタッチ',
  'ヘディング',
  '１対１',
  'ボールキープ',
  'ボールを受ける',
  'クロス',
  'フィニッシュ',
  'サポート',
  'サイドチェンジ',
  'ボレー',
  'フェイント',
  '第三者の動き',
  'パスアンドゴー',
  'スルーパス',

  '１対１',
  'ボディシェープ',
  '予測',
  'インターセプト',
  'タックル',
  'アプローチ',
  'カバーリング',
  'バックステップ',
  'サイドステップ',
  'ポジショニング',
  'バックプレス',
  'リトリート',
  'マーキング',
  '遅らせる',
  'ヘディング',
  'クリアリング',
  'ボディーコンタクト',
  '斜めバックランニング',
  'シールディング',
  'タイミング'
];

export const physicalEval = [
  { title: 'パワー/kg', id: 'avgPow1er' },
  { title: 'ストレングス/m', id: 'avgStreng1th' },
  { title: '持久力/min', id: '1600MProtocolTimeminEndurance1' },
  { title: 'スピード/秒', id: 'avgTimeSpe1ed' },
  { title: 'アジリティ/秒', id: 'avgAgility1' },

  { title: 'パワー/kg', id: 'avgPow2er' },
  { title: 'ストレングス/m', id: 'avgStreng2th' },
  { title: '持久力/min', id: '1600MProtocolTimeminEndurance2' },
  { title: 'スピード/秒', id: 'avgTimeSpe2ed' },
  { title: 'アジリティ/秒', id: 'avgAgility2' },

  { title: 'パワー/kg', id: 'avgPow3er' },
  { title: 'ストレングス/m', id: 'avgStreng3th' },
  { title: '持久力/min', id: '1600MProtocolTimeminEndurance3' },
  { title: 'スピード/秒', id: 'avgTimeSpe3ed' },
  { title: 'アジリティ/秒', id: 'avgAgility3' },

  { title: 'パワー/kg', id: 'avgPow4er' },
  { title: 'ストレングス/m', id: 'avgStreng4th' },
  { title: '持久力/min', id: '1600MProtocolTimeminEndurance4' },
  { title: 'スピード/秒', id: 'avgTimeSpe4ed' },
  { title: 'アジリティ/秒', id: 'avgAgility4' }
];

export const playerInfoFields = [
  '名前　１',
  '名前　２',
  '名前　３',
  'ｊｒ. クラブ',
  'ｊｒ. ユースクラブ',
  '電話番号',
  'メール',

  '保護者名',
  '保護者電話',
  '保護者メール',
  '住所１',
  '住所２',
  '市町村',
  '郵便番号',

  '選手登録番号',
  '登録年月日',
  '身長/cm',
  '体重/kg',
  'BMI',

  'カテゴリー',
  '肩幅/cm',
  '胸囲/cm',
  '腕周り/cm',
  'ウエスト/cm',

  'チーム番号',
  'ヒップ/cm',
  '大腿周り/cm',
  '脹脛/cm',
  '足首/cm',

  'ポジション',
  '血液型',
  'Ｈｂ値',
  'VO2 max l/分',
  '血圧',

  '利き足',
  'ジャージサイズ（上）',
  'ジャージサイズ（下）',
  '靴サイズ',
  '国籍'
];
export const playerInfoEyeFields = [
  'ｊｒ. クラブ',
  'ｊｒ. ユースクラブ',
  'カテゴリー',
  'ポジション',
  '利き足',
  'ジャージサイズ（上）',
  'ジャージサイズ（下）'
];

export const playerListFields = [
  '名前　１',
  '名前　２',
  'ポジション',
  '年齢',
  '学年',
  '欠席',

  '出席',
  '欠席理由',
  'ｊｒ. クラブ',
  'ｊｒユースクラブ',
  'カテゴリー',
  '移籍先',
  'シーズン'
];

export const powerScores = [
  'ジャンプ CMJWA/m',
  'ジャンプ　スクワット　J/m',
  'ジャンプ　6J 手を使って/m',
  'ジャンプ　6J 手を使わない/m',
  'ジャンプ垂直　　左/m',
  'ジャンプ垂直　　右/m',
  '三段跳び　前進/m',
  'ロングスロー　左/m',
  'ロングスロー　右/m',
  'ロングキック　左/m',
  'ロングキック　右/m',

  'ベンチプレス/kg',
  'スクワット/kg',
  'デッドリフト/kg',
  'レッグエクステンション/kg',
  'レッグカール/kg',
  'チェストフライ/kg',
  'マシンロウイング/kg',
  'バックエクステンション/kg'
];

export const rehabilitationFields = [
  '名前　１',
  '名前　２',
  '選手　no.',
  'ｊｒ. クラブ',
  'ｊｒ. ユースクラブ',

  '誕生日',
  'カテゴリー',
  'ポジション',
  'ピッチの状態',
  '受傷した試合',
  '会場',

  '電話番号',
  '保護者電話',
  '天候',
  'コーチ名',
  '受傷時間',
  'メディカルスタッフ名'
];

export const scoutingFields = [
  '名前　１',
  '名前　２',
  '誕生日',
  '身長/cm',
  '利き足',
  'ｊｒ. クラブ',

  'メール',
  '電話番号',
  '体重/kg',
  'ポジション',
  'Jr. ユースクラブ',
  'ユースクラブ',

  '選手のビデオ',
  'ビデオのハイパーリンク',
  '国',
  '地域',
  '住所１',
  '住所２',
  '市町村',
  '郵便番号'
];

export const speedScores = [
  '60m スプリント/秒',
  '50m スプリント/秒',
  '40m スプリント（10ｍごと）/秒',
  '30m スプリント/秒',
  '20m スプリント/秒',
  '10m スプリント/秒'
];

export const teamInfoFields = [
  'ジャンプ CMJWA/m',
  'ジャンプ　スクワット　J/m',
  'ジャンプ　6J 手を使って/m',
  'ジャンプ　6J 手を使わない/m',
  '三段跳び　前進/m',
  'ジャンプ垂直　　左右/m',
  'Hｂ値',

  'ロングスロー　左右/m',
  'ロングキック　左右/m',
  'スクワット/1rm',
  'ベンチプレス/1rm',
  'クーパー　１２分/ラン/m',
  'WMA 45/15 km/h',
  'VO2 max l/分',

  '1600m プロトコル/分',
  'シャトル　テンポ/分',
  'YO YO End. Int. Rec./分',
  '60m スプリント/秒',
  '50m スプリント/秒',
  '40m スプリント/秒',
  '身長/cm',

  '30m スプリント/秒',
  '20m スプリント/秒',
  '10m スプリント/秒',
  'アジリティ測定　ステップ５０/秒',
  'アジリティ測定　前進ラン/秒',
  'ポジション',
  '体重/kg',

  // ////////////

  '誕生日',
  '選手登録番号',
  'チーム番号',
  'メール',
  'ｊｒ. ユースクラブ',

  '利き足',
  '電話番号',
  '保護者電話',
  'BMI',
  '血液型',

  '住所',
  '郵便番号',
  'ジャージサイズ（上）',
  'ジャージサイズ（下）',
  '靴サイズ',

  '保護者名',
  '市町村'
];

export const testingFields = [
  'ジャンプ CMJWA/m',
  'ジャンプ　スクワット　J/m',
  'ジャンプ　6J 手を使って/m',
  'ジャンプ　6J 手を使わない/m',
  '三段跳び　前進/m',
  'ジャンプ垂直　　左右/m',
  'Hｂ値',

  'ロングスロー　左右/m',
  'ロングキック　左右/m',
  'スクワット/1rm',
  'ベンチプレス/1rm',
  'クーパー　１２分/ラン/m',
  'WMA 45/15  km/h',
  'VO2max l/分',

  '1600m プロトコル/分',
  'シャトル　テンポ/分',
  'YO YO End. Int. Rec./分',
  '60m スプリント/秒',
  '50m スプリント/秒',
  '40m スプリント/秒',
  '身長/cm',

  '30m スプリント/秒',
  '20m スプリント/秒',
  '10m スプリント/秒',
  'アジリティ測定　ステップ５０/秒',
  'アジリティ測定　前進ラン/秒',
  'ポジション',
  '体重/kg'
];

export const trainingMovFields = [
  'トレーニング名',
  'トレーニングテーマ',
  'カテゴリー',
  'トレーニング負荷',

  'コーチ名',
  '録画時間',
  'チェック済',

  'トレーニングビデオ',
  'ビデオのハイパーリンク',

  '説明',
  'キーファクター'
];

export const trainingFields = [
  'ウエイトトレーニング上半身',
  'エアロバイク/ube',
  'ウエイトトレーニング体幹',
  'ステアマスター',
  'ウエイトトレーニング下半身',
  'ボディーバランス',
  'エアロバイク/UBE',
  'バランス/片足',

  'ウオーキング',
  'ジグザグランニング',
  'ウオーキング＆ジョギング',
  '１対１',
  'ジョギング',
  'ジャンプ',
  'ピッチ周り12分間',
  'ボレーキック',
  '加速走',
  'dribble',
  '40m 6秒 + 30m 15秒',
  'ショートパス',
  'ハーフコート26秒',
  'ミドルパス',
  'ランダム走',
  'ロングパス',
  'スプリント',
  'シュート',
  'テキスト',
  'クロス',
  '前後ステップ',
  'ポゼッション',
  '左右ステップ',
  'SSG',
  'アジリティドリル',
  'ゲーム'
];
export const trainingCheckBoxes = [
  '有酸素',
  '無酸素',
  'バランスディスク',
  'バランスボード',
  '開眼',
  '閉眼',
  '有酸素',
  '無酸素',
  'バランスディスク',
  'バランスボード',
  '開眼',
  '閉眼',

  'm',
  'm',
  'min',
  'min',
  'w m',
  'j m',
  'w m',
  'j m',
  'ボールなし',
  'ボールあり',
  'w m',
  'j m',
  'w m',
  'j m',
  '両足',
  'ジャンプヘディング',
  '左足',
  'バウンディング',
  '右足',
  '５周',
  '７周',
  '左インサイド',
  '右インサイド',
  '左インステップ',
  '右インステップ',
  '20mx4x2',
  'バランスボード',
  '40mx2x2',
  '20+60x2',
  '10周×３セット',
  '10週×７セット',
  '左インサイド',
  '右インサイド',
  '左インステップ',
  '右インステップ',
  '左インフロント',
  '右インフロント',
  '５周',
  '７周',
  '10周',
  '12 周',
  '左インサイド',
  '右インサイド',
  '左インステップ',
  '右インステップ',
  '左インフロント',
  '右インフロント',
  '左インサイド',
  '右インサイド',
  '左インステップ',
  '右インステップ',
  '左インフロント',
  '右インフロント',
  '5 m',
  '20 m',
  '10 m',
  '30 m',
  '15 m',
  '40 m',
  '左インサイド',
  '右インサイド',
  '左インステップ',
  '右インステップ',
  '左インフロント',
  '右インフロント',
  '左インサイド',
  '右インステップ',
  '4ステップ×5',
  '8ステップ×10',
  '患部側荷重',
  'サイドステップ　ＬＲ',
  'クロスステップ　ＬＲ',
  'キャリオカ　ＬＲ'
];

export const monthlyFields = [
  '強度',
  'WUP',
  'フィジカル',
  '技術',
  'Tr1',
  'Tr2',
  '戦術',
  'Tr',
  'SSG',
  'ゲーム',
  'メインテーマ',
  '会場',
  'シーズン',
  '年',
  '月',
  '日',
  '曜日'
];

export const seasonalFields = [
  '技術',
  '戦術',
  'パワー',
  '持久力',
  '期分け',
  'シーズン'
];

export const appbarListItems = [
  '選手情報',
  'チーム情報',
  '戦術',
  '技術',
  'メンタル',
  // 'フィジカル',
  'フィジカル評価',
  '身体のサイズ',
  'パワー/ストレングス',
  '持久力',
  'スピード',
  'アジリティ',
  // ///////
  'スカウティング',
  'テストプログラム',
  // 'リハビリプランナー',
  '受傷情報　１',
  '受傷情報　２',
  'リハビリ計画',
  // ///////
  'トレーニング動画',
  'ゲーム分析ビデオ',
  // '選手の評価',
  '選手',
  '身体のサイズ',
  'フィジカル',
  '技術、戦術、メンタル',
  '総合評価',
  // game report
  '選手情報',
  'ゲームスタツ',
  'レポートを見る',
  // member list
  'メンバー情報',
  '試合情報',
  'メンバー表を見る',
  // ////////
  // player list
  'プレーヤーリストの追加',
  'プレーヤーリストの表示',
  // //////
  'トレーニングプランナー',
  // /////
  // 'マンスリートレーニングプログラム',
  'トレーニング計画追加',
  '月間計画を表示',
  // //////
  'シーズン計画を追加',
  'シーズン計画の表示',
  // /////
  '年間計画',
  '設定'
];

export const cards = [
  {
    image: require('../assets/images/mainmenu/card1.png'),
    title: 'トレーニングプランナー'
  },
  {
    image: require('../assets/images/mainmenu/card2.png'),
    title: '月間トレーニングプランナー'
  },
  {
    image: require('../assets/images/mainmenu/card3.png'),
    title: 'シーズン計画'
  },
  {
    image: require('../assets/images/mainmenu/card4.png'),
    title: 'リハビリプランナー'
  },
  {
    image: require('../assets/images/mainmenu/card5.png'),
    title: '選手の評価'
  }
];

export const cards2 = [
  {
    image: require('../assets/images/mainmenu/card6.png'),
    title: '試合用メンバーリスト'
  },
  {
    image: require('../assets/images/mainmenu/card7.png'),
    title: 'ゲームレポート'
  },
  {
    image: require('../assets/images/mainmenu/card8.png'),
    title: 'スカウティング＆ビデオ'
  },
  {
    image: require('../assets/images/mainmenu/card9.png'),
    title: 'トレーニングビデオ'
  },
  {
    image: require('../assets/images/mainmenu/card10.png'),
    title: 'ゲーム分析 & ビデオ'
  }
];

export const icons = ['保存', '印刷', 'Pdf'];
export const icons2 = ['印刷', 'Pdf'];


export const methodologyTitleFields = [
  'Main Title',
  'Sub Title',
  'Technical',
  'Tactical',
  'Physical',
  'Mental',
  'Warming Up',
  'SSG',
  'Team'
];